app/controllers/todos_controller.rb

    def create
        # Initialize a new Todo with the parameters, including the current user's ID
        @todo = Todo.new(todo_params.merge(user_id: @current_user.id))

        if @todo.save
---
INSERT INTO "todos" ("title", "content", "user_id", "priority", "completed", "created_at", "updated_at", "due_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
        if @todo.update(todo_params.merge(user_id: @current_user.id))
---
UPDATE "todos" SET "title" = $1, "content" = $2, "priority" = $3, "completed" = $4, "updated_at" = $5, "due_date" = $6 WHERE "todos"."id" = $7  [["title", "testasdasda"], ["content", "testaasdasd"], ["priority", 1], ["completed", false], ["updated_at", "2024-09-18 04:41:44.173917"], ["due_date", "2024-09-18 00:00:00"], ["id", 12]]

      def authenticate_user
        auth_header = request.headers['Authorization']
        if auth_header
          token = auth_header.split(' ')[1]
          begin
            decoded_token = JWT.decode(token, 'j1FnHqRPD2ZRr0hyg6r8SNAjPq5ZoxQy', true, algorithm: 'HS256')
            # Ensure you are referencing the correct key name
            user_id = decoded_token[0]['USER_ID']['user_id']
            @current_user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]