app/controllers/users_controller.rb

INSERT INTO "users" ("email", "username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "[FILTERED]"], ["username", "jimt"], ["created_at", "2024-09-18 05:06:25.561558"], ["updated_at", "2024-09-18 05:06:25.561558"], ["password_digest", "[FILTERED]"]]
---
    def create
      # Strong parameters to allow only the required attributes
      user_params = params.permit(:email, :username, :password)

      # Create a new user with the passed parameters
      user = User.new(user_params)

      if user.save

UPDATE "users" SET "email" = $1, "username" = $2, "updated_at" = $3, "password_digest" = $4 WHERE "users"."id" = $5  [["email", "[FILTERED]"], ["username", "jimt6"], ["updated_at", "2024-09-18 05:08:58.753805"], ["password_digest", "[FILTERED]"], ["id", 7]]
---
    def update
      user_params = params.permit(:email, :username, :password)
      if @current_user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def authenticate_user
      auth_header = request.headers['Authorization']
      if auth_header
        token = auth_header.split(' ')[1]
        begin
          decoded_token = JWT.decode(token, 'j1FnHqRPD2ZRr0hyg6r8SNAjPq5ZoxQy', true, algorithm: 'HS256')
          # Ensure you are referencing the correct key name
          user_id = decoded_token[0]['user_id']
          @current_user = User.find(user_id)